{
  "contactForm": {
    "header": {
      "title": "Would you like to discuss a project, ask a question, or just exchange a \"Hello World\"?"
    },
    "fields": {
      "name": {
        "label": "First & Last Name",
        "placeholder": "Enter your first and last name",
        "error": {
          "length": "Name must be at least 2 characters.",
          "regex": "Only letters, spaces, and dashes are allowed."
        }
      },
      "email": {
        "label": "Email",
        "placeholder": "Example: email@domain.com",
        "error": "Please enter a valid email."
      },
      "message": {
        "label": "Your message",
        "placeholder": "Your message here",
        "error": "Message must be at least 5 characters long."
      },
      "submit_button": "Send"
    }
  },
  "confirmationModal": {
    "title": "Thank you!",
    "message": "Your message has been successfully sent 🚀.",
    "ok_button": "OK"
  },

  "homepage": {
    "Qui je suis?": "Who I am ?",
    "Mon cv": "CV",
    "Mes réalisations": "projects",
    "Contactez-moi": "Contact me",
    "intro_greeting": "Hello, I am",
    "intro_role": "React JavaScript Developer",
    "intro_description": "Passionate about creating intuitive user experiences, I turn ideas into tangible realities through programming.",
    "intro_button_text": "Beyond the code: discover my unique journey.",
    "Mes spécialités": "My Hard Skills",
    "comp_transverses": "My Soft Skills",
    "bio": "After working as a nurse for 20 years, I've learned the value of <Highlight>team work</Highlight>. This experience greatly benefits me in web development. My <Highlight>rigor</Highlight> and <Highlight>listening skills</Highlight>, acquired in the medical world, guide me in every project. I know how important it is to collaborate and understand the needs of others, whether they are patients or <Highlight>website users</Highlight>. Every line of code I write reflects this <Highlight>human-centered</Highlight> approach.",
    "skills": [
      "Empathy",
      "Adaptability",
      "Receptivity to feedback",
      "Teamwork",
      "Communication",
      "Organization",
      "Attention to details"
    ],
    "projects_title": "My projects",
    "projects_learn_more": "Learn more",
    "project_0_title": "Cooking recipes website",
    "project_0_description": "Personal project developed in React, this website presents a variety of cooking recipes.",
    "project_1_title": "Météo France Home Page",
    "project_1_description": "Clone of the Météo France homepage made solely with HTML and CSS.",
    "project_2_title": "Replication of the Netflix Site",
    "project_2_description": "A personal project developed with NextJS, this site is a replication of the Netflix site.",
    "projects_subtitle": "Personal achievements carried out independently of my academic journey, reflecting my passion and commitment to development.",

    "training_projects_subtitle": "Projects completed as part of my web development training, highlighting the technical skills I've acquired.",
    "training_project_0_title": "Accessible Website for a Photographers' Platform",
    "training_project_0_description": "Development of an accessible web platform, to enable photographers to showcase their work.",
    "training_project_1_title": "Peer-to-peer apartment rentals",
    "training_project_1_description": "Project aimed at rebuilding the Kasa apartment rental platform using React and React Router.",
    "training_project_2_title": "Banking Management Platform",
    "training_project_2_description": "Project aimed at developing a web application for Argent Bank.",
    "training_project_3_title": "Employee Records Management",
    "training_project_3_description": "Wealth-Health is a major financial corporation that uses an internal web application to manage employee records."
  },

  "projectDetails": {
    "viewWebsite": "View Website",
    "projectObjectives": "Project Objectives",
    "challengesAndAchievements": "Challenges and Achievements",
    "adaptability": "Adaptability: Catering to Every Device",
    "performanceAndAccessibility": "Performance and Accessibility",
    "towardsCollaboration": "Towards Collaboration: How teamwork could have enriched the project",
    "toolsAndTechnologies": "Tools and Technologies Used"
  },

  "projects": {
    "delicesCulinaires": {
      "id": "delicesCulinaires",
      "title": "Culinary Delights",
      "description": {
        "intro": "A personal project developed in React. This site presents a variety of cooking recipes.",
        "objective": "The main goal was to create an intuitive and responsive cooking recipe platform, while mastering state management with Redux. I also wanted to design a modular architecture with reusable components, optimize the application's performance and ensure its fluidity on all devices thanks to a responsive design.",
        "challenge": "The main difficulty of the project was to think about the structure to adopt for an intuitive user navigation. Conceptualizing the UI/UX required deep thought. The Figma tool allowed me to test different prototypes before arriving at the final version.",
        "responsive": "The site's responsiveness ensures an optimal user experience on all devices, from mobiles to desktop computers.",
        "optimizationAndAccessibility": "I actively sought to make this site inclusive by focusing on accessibility. Thus, I adapted the color contrasts according to WCAG standards. I also favored a custom design with minimal use of external libraries, ensuring performance and fast loadings.",
        "collaboration": [
          "Working in a team, and especially adopting methodologies like Agile and Scrum, several improvements would have been possible for this project.",
          "1. Regular code reviews would have ensured better quality through exchanges and knowledge sharing.",
          "2. Collaboration during UI/UX design phases would have brought different perspectives, contributing to a richer and more refined design.",
          "3. By collaborating with a team, we could have solicited a wider range of users to test the project, thus offering more varied feedback.",
          "4. Task sharing would have accelerated development, with each member bringing their specific skills."
        ]
      },

      "toolsAndTech": [
        {
          "tool": "React & React-Router-Dom",
          "description": "Creation and management of the user interface, including navigation."
        },
        {
          "tool": "Redux & React-Redux",
          "description": "Centralized management of the application's state."
        },
        {
          "tool": "Styled-Components",
          "description": "CSS-in-JS styling for custom design."
        },
        {
          "tool": "Vite",
          "description": "Development tool for fast builds and efficient development."
        },
        {
          "tool": "Figma",
          "description": "Design and prototyping of the UI/UX."
        },
        {
          "tool": "Vercel",
          "description": "Deployment and hosting of the application."
        }
      ]
    },

    "meteoFrance": {
      "id": "meteoFrance",
      "title": "Météo France Homepage Clone",
      "description": {
        "intro": "This project consisted of faithfully reproducing the homepage of the Météo France site using exclusively HTML and SCSS.",
        "objective": "The main goal of this project was to understand and master the fundamental basics of web development. Working without frameworks or libraries, I sought to hone my skills in layout, typography, and responsiveness.",
        "challenge": "The biggest challenge of this project was to accurately reproduce the various design elements of the original site while ensuring compatibility across different browsers and screen sizes. This challenge allowed me to deepen my understanding of the nuances and subtleties of CSS.",
        "responsive": "The site's responsiveness ensures an optimal user experience on all devices, from mobiles to desktop computers.",
        "optimizationAndAccessibility": "In reproducing the Météo France homepage, I emphasized accessibility while respecting the original design. Through exclusive work in HTML and CSS, I optimized the site's lightness for fast loadings.",
        "collaboration": [
          "Being an individual reproduction project, I did not collaborate with others. However, the input of a team could have offered different perspectives on layout and design, and would have allowed me to learn new tricks and techniques."
        ]
      },
      "toolsAndTech": [
        {
          "tool": "HTML",
          "description": "Basic site structure and setting up main elements."
        },
        {
          "tool": "SCSS",
          "description": "Customization, design, and responsive layout of the site."
        }
      ]
    },
    "studyNetifly": {
      "id": "studyNetifly",
      "title": "Replication of the Netflix Site",
      "description": {
        "intro": "Currently developing a Netflix-like site using NextJS, with updates and new features to be added soon.",
        "objective": "The main objective was to develop advanced skills in creating modern web applications, particularly in managing global state, authentication, and database communication.",
        "challenge": "The main challenge was managing user authentication and data, while ensuring a smooth and responsive user experience, similar to that of Netflix.",
        "responsive": "The site is fully responsive, providing an optimal user experience on all devices, from mobiles to desktop computers.",
        "optimizationAndAccessibility": "Special attention was given to performance optimization and accessibility, using best practices in web development.",
        "collaboration": [
          "Working as a team on this Netflix clone, and particularly adopting methodologies like Agile and Scrum, would have allowed for several improvements to this project.",
          "1. Regular code reviews would have ensured better quality and a more robust architecture through exchange and knowledge sharing, especially useful for advanced technologies like Redux and Next.js.",
          "2. Collaborating with a team, we could have sought a wider range of users to test the project, thus providing more varied feedback and improving accessibility and responsiveness.",
          "3. Task sharing, particularly in areas like data management with MongoDB and secure communication with tools like JWT, would have sped up development, with each member bringing their specific skills.",
          "4. Implementing collaborative development practices, such as continuous integration and frequent deployments, would have fostered a more efficient workflow and better management of the site's features."
        ]
      },
      "toolsAndTech": [
        {
          "tool": "Next.js",
          "description": "Framework used for building and server-side rendering of the site."
        },
        {
          "tool": "Styled Components",
          "description": "Used for customization and design, facilitating the implementation of themes and responsive styles."
        },
        {
          "tool": "Redux",
          "description": "Global state management of the application, facilitating communication between components."
        },
        {
          "tool": "MongoDB & Mongoose",
          "description": "Database for storing user information and integration with Mongoose for data modeling."
        },
        {
          "tool": "API REST TMDB",
          "description": "Used to retrieve information on movies and series to simulate the Netflix experience."
        },
        {
          "tool": "JWT (JSON Web Tokens)",
          "description": "Used for secure management of user sessions and authentication."
        },
        {
          "tool": "Nodemailer",
          "description": "Tool for sending emails, such as for password resets or account confirmations."
        },
        {
          "tool": "Nookies",
          "description": "Used for cookie manipulation, essential in managing sessions and user preferences."
        },
        {
          "tool": "Bcrypt",
          "description": "For secure hashing of passwords, ensuring the security of user data."
        }
      ]
    },
    "fisheye": {
      "id": "fisheye",
      "title": "Accessible Website for a Photographer Platform",
      "description": {
        "intro": "Project aimed at creating an accessible website for a photographer platform.",
        "objective": "The main objective was to ensure the website's accessibility while writing maintainable JavaScript code.",
        "challenge": "The main challenge of this project was to ensure complete accessibility in compliance with WCAG standards. To overcome these challenges, I consulted WCAG recommendations, which guided me in implementing keyboard navigation and the correct use of ARIA tags. I also used accessibility verification tools and sought user feedback to ensure that these features were indeed accessible.",
        "responsive": "The site's responsiveness ensures an optimal user experience on all devices, from mobiles to desktop computers.",
        "collaboration": [
          "Working in a team, and especially adopting methodologies like Agile and Scrum, several improvements would have been possible for this project.",
          "1. Regular code reviews would have ensured better quality through exchanges and knowledge sharing.",
          "2. Collaboration during UI/UX design phases would have brought different perspectives, contributing to a richer and more refined design.",
          "3. By collaborating with a team, we could have solicited a wider range of users to test the project, thus offering more varied feedback.",
          "4. Task sharing would have accelerated development, each member bringing their specific skills."
        ],
        "optimizationAndAccessibility": "In terms of performance, I used Webpack to reduce loading times and offer a more responsive user experience. In parallel, I adapted color choices to be in compliance with WCAG standards, thus strengthening the site's accessibility."
      },
      "toolsAndTech": [
        {
          "tool": "CSS",
          "description": "Layout and styling of the user interface."
        },
        {
          "tool": "Webpack",
          "description": "Performance optimization and reduction of loading times."
        },
        {
          "tool": "ESLint",
          "description": "Ensuring JavaScript code quality through static analysis."
        },
        {
          "tool": "JavaScript",
          "description": "Programming language used to create client-side dynamic interactions."
        },
        {
          "tool": "WCAG",
          "description": "Compliance with accessibility guidelines to make the site usable by the widest audience."
        },
        {
          "tool": "Wave",
          "description": "Accessibility evaluation tool based on WCAG standards."
        },
        {
          "tool": "Figma",
          "description": "Design and prototyping of the UI/UX."
        },
        {
          "tool": "GitHub Pages",
          "description": "Deployment and hosting of the application."
        }
      ]
    },
    "kasa": {
      "id": "kasa",
      "title": "Platform for peer-to-peer apartment rentals",
      "externalLink": "https://github.com/angelique31/P11--kasa",
      "description": {
        "intro": "Project aimed at rebuilding the Kasa apartment rental platform using React and React Router.",
        "objective": "The primary objective was to modernize an existing application with a more recent technology stack while respecting performance and accessibility constraints.",
        "challenge": "The main challenge of this project was migrating from an aging ASP.NET codebase to React, ensuring compatibility and accessibility. I followed Kasa's coding guidelines to ensure code quality.",
        "responsive": "The site is designed to be fully responsive, ensuring a smooth user experience across all devices.",
        "collaboration": [
          "Working in a team, particularly when adopting methodologies such as Agile and Scrum, several improvements would have been possible for this project.",
          "1. Regular code reviews would have ensured better quality through discussions and knowledge sharing.",
          "2. Collaboration during the UI/UX design phases would have provided different perspectives, leading to a richer and more polished design.",
          "3. By collaborating with a team, we could have solicited a broader range of users to test the project, thus obtaining more diverse feedback.",
          "4. Task sharing would have sped up the development, with each member bringing their specific skills."
        ],
        "optimizationAndAccessibility": "As this project was an academic exercise, I was unable to modify the source images for educational reasons. This impacted the site's performance score, specifically in the Lighthouse report where it reached 92%. In a real project, I would have used image compression tools, reducing file sizes, which would have accelerated loading times. Regarding the accessibility score, the color constraints in the academic mockup prevented me from achieving a higher score. In a professional context, I would have adjusted the colors to meet WCAG standards and improve accessibility."
      },
      "additionalImages": [
        "/assets/kasa/kasa_desktop.png",
        "/assets/kasa/kasa_mobile.png",
        "/assets/kasa/performance.png"
      ],
      "toolsAndTech": [
        {
          "tool": "Create React App tool",
          "description": "Creating dynamic user interfaces."
        },
        {
          "tool": "React Router",
          "description": "Managing routing within the application."
        },
        {
          "tool": "Sass",
          "description": "Layout and styling."
        },
        {
          "tool": "ESLint",
          "description": "Used to ensure code robustness."
        },
        {
          "tool": "Lighthouse",
          "description": "Measuring performance and accessibility."
        },
        {
          "tool": "GitHub",
          "description": "Source code management and collaboration."
        }
      ]
    },
    "argentBank": {
      "id": "argentBank",
      "title": "Banking Management Platform",

      "description": {
        "intro": "Project aimed at developing a web application for Argent Bank. The platform offers authentication features, account and profile management, and a potential extension for transaction management. For demonstration purposes, use the following credentials: \n\nTony Stark\nEmail: tony@stark.com\nPassword: password123\n\nSteve Rogers\nEmail: steve@rogers.com\nPassword: password456",
        "objective": "The main goal is to provide Argent Bank with a robust solution to break into the online banking sector. The project is divided into two phases, starting with user authentication and ending with transaction management.",
        "challenge": "Challenges of this project include the integration of JWT authentication, state management with Redux, creating a responsive interface with React, and securely storing data in MongoDB.",
        "responsive": "The site is designed to be fully responsive, ensuring a smooth user experience on all devices.",
        "collaboration": [
          "Working as a team, and notably adopting methodologies like Agile and Scrum, several improvements could have been possible for this project.",
          "1. Regular code reviews would have ensured better quality through exchanges and knowledge sharing.",
          "2. Collaboration during UI/UX design phases would have brought different perspectives, contributing to a richer and more accomplished design.",
          "3. By collaborating with a team, we could have solicited a wider range of users to test the project, thus providing more varied feedback.",
          "4. Task sharing would have accelerated development, each member bringing their specific skills."
        ],
        "optimizationAndAccessibility": "The application has been optimized for fast performance and high accessibility. Tools such as Lighthouse will be used to measure and improve these aspects."
      },
      "toolsAndTech": [
        {
          "tool": "Creat React app tool",
          "description": "Creating dynamic user interfaces."
        },
        {
          "tool": "React Router",
          "description": "Managing routing in the application."
        },
        {
          "tool": "Redux",
          "description": "Manages the global state of the application."
        },
        {
          "tool": "Styled components",
          "description": "JavaScript library for CSS management."
        },
        {
          "tool": "ESLint",
          "description": "Used to ensure code robustness."
        },
        {
          "tool": "Lighthouse",
          "description": "Measures performance and accessibility."
        },
        {
          "tool": "MongoDB",
          "description": "Database used to store user information."
        },
        {
          "tool": "GitHub",
          "description": "Source code management and collaboration."
        }
      ]
    },
    "wealthHealth": {
      "id": "wealthHealth",
      "title": "Employee Records Management of Wealth-Health",

      "description": {
        "intro": "Wealth-Health is a major financial corporation that uses an internal web application to manage employee records. The application is dated and employs jQuery on the front-end, leading to significant bugs.",
        "objective": "Modernize the application by transitioning it to a React-based architecture and replace jQuery plugins with React components. The goal is to enhance performance and reduce user complaints.",
        "challenge": "During Phase 1, migrating to React posed challenges due to architectural differences. I utilized the Vite tool to ease this transition and tested each component post-rewrite. For Phase 2, replacing jQuery plugins with React components presented compatibility challenges. However, a thorough review of the plugins and targeted rewriting enabled a smooth transition.",
        "responsive": "The website is designed to be fully responsive, ensuring a smooth user experience across all devices.",
        "collaboration": [
          "Working as a team, and especially adopting methodologies like Agile and Scrum, several improvements would have been possible for this project.",
          "1. Regular code reviews would have ensured higher quality through discussions and knowledge sharing.",
          "2. Collaborating during the UI/UX design phases would have brought in varied perspectives, leading to a richer and more finalized design.",
          "3. By collaborating with a team, we could have tapped into a broader user base for project testing, thus getting more diverse feedback.",
          "4. Task sharing would have sped up the development, each member bringing their specific skills."
        ],
        "optimizationAndAccessibility": "Conduct performance tests using Lighthouse by comparing the old and the new application."
      },

      "toolsAndTech": [
        {
          "tool": "Vite Tool",
          "description": "Creation of dynamic user interfaces."
        },
        {
          "tool": "React Router",
          "description": "Managing application routing."
        },
        {
          "tool": "React Context",
          "description": "Manages the global state of the application."
        },
        {
          "tool": "Styled components",
          "description": "Javascript library for CSS management."
        },
        {
          "tool": "ESLint",
          "description": "Used to ensure code robustness."
        },
        {
          "tool": "Lighthouse",
          "description": "Measures performance and accessibility."
        },
        {
          "tool": "GitHub",
          "description": "Manages source code and collaboration."
        },
        {
          "tool": "Vercel",
          "description": "Deployment platform."
        },
        {
          "tool": "NPM",
          "description": "For publishing the library."
        }
      ]
    }
  },

  "skillsData": {
    "empathy": {
      "skill": "Empathy",
      "description": "The user is at the heart of my approach, creating intuitive and relevant interfaces."
    },
    "organization": {
      "skill": "Organizational Skills",
      "description": "From hospital work to coding, I've learned how to prioritize my tasks effectively."
    },
    "adaptability": {
      "skill": "Adaptability",
      "description": "I love joining new teams, quickly adapting and collaborating effectively."
    },
    "listening": {
      "skill": "Listening",
      "description": "I take the time to listen carefully and value every piece of feedback."
    },
    "curiosity": {
      "skill": "Curiosity",
      "description": "Every day is a chance to learn and hone my development skills."
    },
    "autonomy": {
      "skill": "Autonomy",
      "description": "I like taking the initiative to move projects forward effectively."
    },
    "tenacity": {
      "skill": "Tenacity",
      "description": "I stay committed to every challenge, always seeking the optimal solution."
    },
    "relationship": {
      "skill": "Interpersonal Skills",
      "description": "Collaboration is my strength. Together, we achieve the best results."
    }
  },

  "hardSkillsData": {
    "programmingLanguages": {
      "category": "Programming Languages",
      "skills": [
        {
          "name": "JavaScript",
          "url": "https://developer.mozilla.org/fr/docs/Web/JavaScript"
        },
        {
          "name": "HTML",
          "url": "https://developer.mozilla.org/fr/docs/Web/HTML"
        },
        {
          "name": "CSS",
          "url": "https://developer.mozilla.org/fr/docs/Web/CSS"
        }
      ]
    },
    "librariesFrameworks": {
      "category": "Bibliothèques / Frameworks",
      "skills": [
        {
          "name": "React.js",
          "url": "https://reactjs.org/"
        },
        {
          "name": "Redux",
          "url": "https://redux.js.org/"
        },
        {
          "name": "Context API",
          "url": "https://react.dev/"
        }
      ]
    },

    "preprocessors": {
      "category": "Preprocessors & CSS-in-JS",
      "skills": [
        {
          "name": "Styled Components",
          "url": "https://styled-components.com/"
        },
        {
          "name": "Sass",
          "url": "https://sass-lang.com/"
        }
      ]
    },
    "toolsEnvironments": {
      "category": "Outils et Environnements",
      "skills": [
        {
          "name": "Git & GitHub",
          "url": "https://github.com/"
        },
        {
          "name": "Webpack",
          "url": "https://webpack.js.org/"
        },
        {
          "name": "Babel",
          "url": "https://babeljs.io/"
        },
        {
          "name": "npm",
          "url": "https://www.npmjs.com/"
        },
        {
          "name": "Visual Studio Code",
          "url": "https://code.visualstudio.com/"
        }
      ]
    },

    "testingTools": {
      "category": "Outils de test",
      "skills": [
        {
          "name": "Jest",
          "url": "https://jestjs.io/"
        },
        {
          "name": "Vitest",
          "url": "https://vitest.dev/guide/"
        }
      ]
    },
    "otherTechnicalSkills": {
      "category": "Autres Compétences Techniques",
      "skills": [
        {
          "name": "Responsive Web Design",
          "url": "https://developer.mozilla.org/fr/docs/Apprendre/CSS/CSS_layout/Responsive_Design"
        },
        {
          "name": "Web Accessibility",
          "url": "https://www.w3.org/WAI/fundamentals/accessibility-intro/"
        }
      ]
    },

    "methodologies": {
      "category": "Méthodologies",
      "skills": [
        {
          "name": "Agile & Scrum",
          "url": "https://www.scrumguides.org/scrum-guide.html"
        },
        {
          "name": "Kanban",
          "url": "https://kanbanguides.org/francais/"
        }
      ]
    }
  },
  "professionalExperienceData": [
    {
      "position": "Temporary Assignments",
      "institution": "Biolab Laboratory, Pasteur Clinic",
      "duration": "2015 – 2022",
      "location": "Location: Toulouse"
    },
    {
      "position": "Temporary Assignments at CHU",
      "duration": "2010 – 2015",
      "location": "Location: Toulouse"
    },
    {
      "position": "General Surgery",
      "institution": "Saint Louis Hospital",
      "duration": "2004 – 2010",
      "location": "Location: Paris"
    }
  ],

  "educationSection": {
    "card1": {
      "dateRange": "2022 - 2023",
      "title": "JavaScript-React Application Developer Training"
    },
    "card2": {
      "dateRange": "2004",
      "title": "State Registered Nurse Diploma"
    },
    "card3": {
      "dateRange": "1999",
      "title": "Baccalaureate in Health and Social Sciences"
    }
  },

  "hobbies": {
    "item1": {
      "text": "Cooking",
      "alt": "Cooking logo"
    },
    "item2": {
      "text": "Reading",
      "alt": "Reading logo"
    },
    "item3": {
      "text": "Hiking",
      "alt": "Hiking logo"
    }
  },

  "bioPage": {
    "header": {
      "h1": "Javascript React Application Developer",
      "bioDescription": "After an enriching career as a nurse, I have transitioned into web development with a specialization in front-end. Highly motivated, I am ready to take on new challenges in this exciting field."
    },
    "sectionTitles": {
      "softSkills": "My Soft Skills",
      "hardSkills": "My Technical Skills",
      "professionalExperience": "My Professional Experience",
      "education": "Education and Qualifications",
      "hobbies": "Interests"
    }
  },
  "footer": {
    "paragraphs": {
      "designedBy": "Designed and developed with passion by",
      "copyright": "© 2023 - Angélique Rosin",
      "findMe": "Find me on:"
    }
  }
}
