{
  "homepage": {
    "welcome": "Bienvenue sur mon portfolio!",
    "Qui je suis?": "Qui je suis?",
    "Mon cv": "Mon cv",
    "Mes réalisations": "Mes réalisations",
    "Contactez-moi": "Contactez-moi",
    "intro_greeting": "Bonjour, je suis",
    "intro_role": "Développeuse Javascript React",
    "intro_description": "Passionnée par la création d'expériences utilisateur intuitives, je transforme les idées en réalités concrètes à travers la programmation.",
    "Mes spécialités": "Mes spécialités",
    "comp_transverses": "Compétences transverses",
    "bio": "Après avoir exercé le métier d'<Highlight>infirmière</Highlight> pendant 20 ans, j'ai appris la valeur du <Highlight>travail en équipe</Highlight>. Cette expérience m'aide énormément en développement web. Ma <Highlight>rigueur</Highlight> et mon <Highlight>sens de l'écoute</Highlight>, acquis dans le monde médical, me guident dans chaque projet. Je sais combien il est important de collaborer et de comprendre les besoins des autres, que ce soit des patients ou des <Highlight>utilisateurs</Highlight> d'un site web. Chaque ligne de code que je rédige reflète cette approche centrée sur l'<Highlight>humain</Highlight>.",
    "skills": [
      "Empathie",
      "Adaptabilité",
      "Réceptivité aux feedbacks",
      "Travail d'équipe",
      "Communication",
      "Organisation",
      "Attention aux détails"
    ],
    "projects_title": "Mes réalisations",
    "projects_learn_more": "En savoir plus",
    "project_0_title": "Site de recettes de cuisine",
    "project_0_description": "Projet personnel développé en React, ce site présente une variété de recettes de cuisine.",
    "project_1_title": "Page d'accueil Météo France",
    "project_1_description": "Réplique de la page d'accueil de Météo France réalisée uniquement avec HTML et CSS.",
    "projects_subtitle": "Réalisations personnelles menées indépendamment de mon parcours académique, reflétant ma passion et mon engagement envers le développement."
  },

  "projectDetails": {
    "viewWebsite": "Voir le site",
    "projectObjectives": "Objectifs du Projet",
    "challengesAndAchievements": "Défis et Réalisations",
    "adaptability": "Adaptabilité : Répondre à Chaque Dispositif",
    "performanceAndAccessibility": "Performance et Accessibilité",
    "towardsCollaboration": "Vers une Collaboration : Comment le travail d'équipe aurait pu enrichir le projet",
    "toolsAndTechnologies": "Outils et Technologies utilisés"
  },

  "projects": {
    "delicesCulinaires": {
      "title": "Délices Culinaires",
      "description": {
        "intro": "Projet personnel développé en React. Ce site présente une variété de recettes de cuisine.",
        "objective": "L'objectif principal était de créer une plateforme intuitive et réactive de recettes de cuisine, tout en maîtrisant la gestion d'état avec Redux. Je voulais également concevoir une architecture modulaire avec des composants réutilisables, optimiser les performances de l'application et garantir sa fluidité sur tous les appareils grâce à un design adapté.",
        "challenge": "La principale difficulté du projet a été de réfléchir à la structure à adopter pour une navigation intuitive de l'utilisateur. La conceptualisation de l'UI/UX m'a demandé une réflexion approfondie, particulièrement dans l'anticipation des besoins et des comportements des utilisateurs. L’outil Figma m’a permis de tester différents prototypes avant d'arriver à la version finale.",
        "responsive": "La responsivité du site garantit une expérience utilisateur optimale sur tous les dispositifs, des mobiles aux ordinateurs de bureau.",
        "optimizationAndAccessibility": "J'ai activement cherché à rendre ce site inclusif en mettant l'accent sur l'accessibilité. Ainsi, j'ai adapté les contrastes de couleurs selon les normes WCAG . J'ai également privilégié une conception sur mesure avec une utilisation minimale de librairies externes, garantissant performance et chargements rapides",
        "collaboration": [
          "En travaillant en équipe, et notamment en adoptant des méthodologies comme Agile et Scrum, plusieurs améliorations auraient été possibles pour ce projet.",
          "1. Des revues de code régulières auraient assuré une meilleure qualité grâce aux échanges et au partage de connaissances.",
          "2. La collaboration lors des phases de conception UI/UX aurait apporté différentes perspectives, contribuant à un design plus riche et abouti.",
          "3. En collaborant avec une équipe, nous aurions pu solliciter un éventail plus large d'utilisateurs pour tester le projet, offrant ainsi des retours plus variés.",
          "4. Le partage des tâches aurait accéléré le développement, chaque membre apportant ses compétences spécifiques."
        ]
      },

      "toolsAndTech": [
        "- React & React-Router-Dom: Création et gestion de l'interface utilisateur, y compris la navigation.",
        "- Redux & React-Redux: Gestion centralisée de l'état de l'application.",
        "- Styled-Components: Styling CSS-in-JS pour une conception personnalisée.",
        "- Vite: Outil de développement pour une construction rapide et un développement efficace.",
        "- Figma: Conception et prototypage de l'UI/UX.",
        "- Vercel: Déploiement et hébergement de l'application."
      ]
    },
    "meteoFrance": {
      "title": "Clone de la page d'accueil Météo France",
      "description": {
        "intro": "Ce projet consistait à reproduire fidèlement la page d'accueil du site Météo France en utilisant exclusivement HTML et CSS.",
        "objective": "L'objectif principal de ce projet était de comprendre et de maîtriser les bases fondamentales du développement web. En travaillant sans frameworks ni bibliothèques, j'ai cherché à affiner mes compétences en matière de mise en page, de typographie et de responsivité.",
        "challenge": "La plus grande difficulté de ce projet a été de reproduire avec précision les différents éléments de design du site original, tout en assurant une compatibilité sur les différents navigateurs et tailles d'écran. Ce défi m'a permis d'approfondir ma compréhension des nuances et subtilités du CSS.",
        "responsive": "La responsivité du site garantit une expérience utilisateur optimale sur tous les dispositifs, des mobiles aux ordinateurs de bureau.",
        "optimizationAndAccessibility": "En reproduisant la page d'accueil de Météo France, j'ai mis l'accent sur l'accessibilité tout en respectant le design original. Grâce à un travail exclusif en HTML et CSS, j'ai optimisé la légèreté du site pour des chargements rapides.",
        "collaboration": "Ce projet étant une reproduction individuelle, je n'ai pas travaillé en collaboration avec d'autres. Toutefois, l'apport d'une équipe aurait pu offrir des perspectives différentes sur la mise en page et le design, et m'aurait permis d'apprendre de nouvelles astuces et techniques.",
        "toolsAndTech": [
          "- HTML: Structure de base du site et mise en place des éléments principaux..",
          "- CSS: Personnalisation, design, et mise en page responsive du site."
        ]
      }
    }
  }
}
