{
  "contactForm": {
    "header": {
      "title": "Vous souhaitez discuter d'un projet, poser une question ou juste échanger un \"Hello World\"?"
    },
    "fields": {
      "name": {
        "label": "Nom & Prénom",
        "placeholder": "Entrez votre nom et votre prénom",
        "error": {
          "length": "Le nom & prénom doivent avoir au moins 2 caractères.",
          "regex": "Seuls les lettres, espaces et tirets sont autorisés."
        }
      },
      "email": {
        "label": "Email",
        "placeholder": "Exemple : email@domaine.com",
        "error": "Veuillez saisir un email valide"
      },
      "message": {
        "label": "Votre message",
        "placeholder": "Votre message ici",
        "error": "Le message doit avoir au moins 5 caractères."
      },
      "submit_button": "Envoyer"
    }
  },
  "confirmationModal": {
    "title": "Merci !",
    "message": "Votre message a été envoyé avec succès 🚀.",
    "ok_button": "OK"
  },

  "homepage": {
    "welcome": "Bienvenue sur mon portfolio!",
    "Qui je suis?": "Qui je suis?",
    "Mon cv": "Mon cv",
    "Mes réalisations": "Mes réalisations",
    "Contactez-moi": "Contactez-moi",
    "intro_greeting": "Bonjour, je suis",
    "intro_role": "Développeuse Javascript React",
    "intro_description": "Passionnée par la création d'expériences utilisateur intuitives, je transforme les idées en réalités concrètes à travers la programmation.",
    "intro_button_text": "Au-delà du code : découvrez mon parcours unique.",
    "Mes spécialités": "Compétences techniques",
    "comp_transverses": "Compétences transverses",
    "bio": "Après avoir exercé le métier d'<Highlight>infirmière</Highlight> pendant 20 ans, j'ai appris la valeur du <Highlight>travail en équipe</Highlight>. Cette expérience m'aide énormément en développement web. Ma <Highlight>rigueur</Highlight> et mon <Highlight>sens de l'écoute</Highlight>, acquis dans le monde médical, me guident dans chaque projet. Je sais combien il est important de collaborer et de comprendre les besoins des autres, que ce soit des patients ou des <Highlight>utilisateurs</Highlight> d'un site web. Chaque ligne de code que je rédige reflète cette approche centrée sur l'<Highlight>humain</Highlight>.",
    "skills": [
      "Empathie",
      "Adaptabilité",
      "Réceptivité aux feedbacks",
      "Travail d'équipe",
      "Communication",
      "Organisation",
      "Attention aux détails"
    ],
    "projects_title": "Mes réalisations",
    "projects_learn_more": "En savoir plus",
    "project_0_title": "Site de recettes de cuisine",
    "project_0_description": "Projet personnel développé en React, ce site présente une variété de recettes de cuisine.",
    "project_1_title": "Page d'accueil Météo France",
    "project_1_description": "Réplique de la page d'accueil de Météo France réalisée uniquement avec HTML et CSS.",
    "projects_subtitle": "Réalisations personnelles menées indépendamment de mon parcours académique, reflétant ma passion et mon engagement envers le développement.",

    "training_projects_subtitle": "Projets réalisés dans le cadre de ma formation en développement web, mettant en avant les compétences techniques que j'ai acquises.",
    "training_project_0_title": "Site accessible pour une plateforme de photographes",
    "training_project_0_description": "Développement d'une plateforme web accessible, pour permettre aux photographes de présenter leurs travaux.",
    "training_project_1_title": "Location d'appartements entre particuliers",
    "training_project_1_description": "Projet visant à reconstruire la plateforme de location d'appartements de Kasa avec React et React Router.",
    "training_project_2_title": "Plateforme de gestion bancaire",
    "training_project_2_description": "Projet visant à développer une application web pour Argent Bank.",
    "training_project_3_title": "Gestion des dossiers des employés ",
    "training_project_3_description": "Wealth-Health est une grande société financière qu'il a fallu moderniser en la basculant sur une architecture React"
  },

  "projectDetails": {
    "viewWebsite": "Voir le site",
    "projectObjectives": "Objectifs du Projet",
    "challengesAndAchievements": "Défis et Réalisations",
    "adaptability": "Adaptabilité : Répondre à Chaque Dispositif",
    "performanceAndAccessibility": "Performance et Accessibilité",
    "towardsCollaboration": "Vers une Collaboration : Comment le travail d'équipe aurait pu enrichir le projet",
    "toolsAndTechnologies": "Outils et Technologies utilisés"
  },

  "projects": {
    "delicesCulinaires": {
      "id": "delicesCulinaires",
      "title": "Délices Culinaires",
      "description": {
        "intro": "Projet personnel développé en React. Ce site présente une variété de recettes de cuisine.",
        "objective": "L'objectif principal était de créer une plateforme intuitive et réactive de recettes de cuisine, tout en maîtrisant la gestion d'état avec Redux. Je voulais également concevoir une architecture modulaire avec des composants réutilisables, optimiser les performances de l'application et garantir sa fluidité sur tous les appareils grâce à un design adapté.",
        "challenge": "La principale difficulté du projet a été de réfléchir à la structure à adopter pour une navigation intuitive de l'utilisateur. La conceptualisation de l'UI/UX m'a demandé une réflexion approfondie. L’outil Figma m’a permis de tester différents prototypes avant d'arriver à la version finale.",
        "responsive": "La responsivité du site garantit une expérience utilisateur optimale sur tous les dispositifs, des mobiles aux ordinateurs de bureau.",
        "optimizationAndAccessibility": "J'ai activement cherché à rendre ce site inclusif en mettant l'accent sur l'accessibilité. Ainsi, j'ai adapté les contrastes de couleurs selon les normes WCAG . J'ai également privilégié une conception sur mesure avec une utilisation minimale de librairies externes, garantissant performance et chargements rapides",
        "collaboration": [
          "En travaillant en équipe, et notamment en adoptant des méthodologies comme Agile et Scrum, plusieurs améliorations auraient été possibles pour ce projet.",
          "1. Des revues de code régulières auraient assuré une meilleure qualité grâce aux échanges et au partage de connaissances.",
          "2. La collaboration lors des phases de conception UI/UX aurait apporté différentes perspectives, contribuant à un design plus riche et abouti.",
          "3. En collaborant avec une équipe, nous aurions pu solliciter un éventail plus large d'utilisateurs pour tester le projet, offrant ainsi des retours plus variés.",
          "4. Le partage des tâches aurait accéléré le développement, chaque membre apportant ses compétences spécifiques."
        ]
      },

      "toolsAndTech": [
        {
          "tool": "React & React-Router-Dom",
          "description": "Création et gestion de l'interface utilisateur, y compris la navigation."
        },
        {
          "tool": "Redux & React-Redux",
          "description": "Gestion centralisée de l'état de l'application."
        },
        {
          "tool": "Styled-Components",
          "description": "Styling CSS-in-JS pour une conception personnalisée."
        },
        {
          "tool": "Vite",
          "description": "Outil de développement pour une construction rapide et un développement efficace."
        },
        {
          "tool": "Figma",
          "description": "Conception et prototypage de l'UI/UX."
        },
        {
          "tool": "Vercel",
          "description": "Déploiement et hébergement de l'application."
        }
      ]
    },
    "meteoFrance": {
      "id": "meteoFrance",
      "title": "Clone de la page d'accueil Météo France",
      "description": {
        "intro": "Ce projet consistait à reproduire fidèlement la page d'accueil du site Météo France en utilisant exclusivement HTML et SCSS.",
        "objective": "L'objectif principal de ce projet était de comprendre et de maîtriser les bases fondamentales du développement web. En travaillant sans frameworks ni bibliothèques, j'ai cherché à affiner mes compétences en matière de mise en page, de typographie et de responsivité.",
        "challenge": "La plus grande difficulté de ce projet a été de reproduire avec précision les différents éléments de design du site original, tout en assurant une compatibilité sur les différents navigateurs et tailles d'écran. Ce défi m'a permis d'approfondir ma compréhension des nuances et subtilités du CSS.",
        "responsive": "La responsivité du site garantit une expérience utilisateur optimale sur tous les dispositifs, des mobiles aux ordinateurs de bureau.",
        "optimizationAndAccessibility": "En reproduisant la page d'accueil de Météo France, j'ai mis l'accent sur l'accessibilité tout en respectant le design original. Grâce à un travail exclusif en HTML et CSS, j'ai optimisé la légèreté du site pour des chargements rapides.",
        "collaboration": [
          "Ce projet étant une reproduction individuelle, je n'ai pas travaillé en collaboration avec d'autres. Toutefois, l'apport d'une équipe aurait pu offrir des perspectives différentes sur la mise en page et le design, et m'aurait permis d'apprendre de nouvelles astuces et techniques."
        ]
      },
      "toolsAndTech": [
        {
          "tool": "HTML",
          "description": "Structure de base du site et mise en place des éléments principaux."
        },
        {
          "tool": "SCSS",
          "description": "Personnalisation, design, et mise en page responsive du site."
        }
      ]
    },
    "fisheye": {
      "id": "fisheye",
      "title": "Site accessible pour une plateforme de photographes",
      "description": {
        "intro": "Projet consistant à créer un site accessible pour une plateforme de photographes.",
        "objective": "L'objectif principal était d'assurer l'accessibilité d'un site web tout en écrivant du code JavaScript maintenable.",
        "challenge": "Le principal défi de ce projet a été d'assurer une accessibilité complète en conformité avec les normes WCAG. Afin de surmonter ces défis, j'ai consulté les recommandations du WCAG, ce qui m'a guidé dans la mise en place de la navigation au clavier et de l'utilisation correcte des balises ARIA. J'ai également utilisé des outils de vérification d'accessibilité et sollicité des retours d'utilisateurs pour m'assurer que ces fonctionnalités étaient effectivement accessibles.",
        "responsive": "La responsivité du site garantit une expérience utilisateur optimale sur tous les dispositifs, des mobiles aux ordinateurs de bureau.",
        "collaboration": [
          "En travaillant en équipe, et notamment en adoptant des méthodologies comme Agile et Scrum, plusieurs améliorations auraient été possibles pour ce projet.",
          "1. Des revues de code régulières auraient assuré une meilleure qualité grâce aux échanges et au partage de connaissances.",
          "2. La collaboration lors des phases de conception UI/UX aurait apporté différentes perspectives, contribuant à un design plus riche et abouti.",
          "3. En collaborant avec une équipe, nous aurions pu solliciter un éventail plus large d'utilisateurs pour tester le projet, offrant ainsi des retours plus variés.",
          "4. Le partage des tâches aurait accéléré le développement, chaque membre apportant ses compétences spécifiques."
        ],
        "optimizationAndAccessibility": "En matière de performance, j'ai utilisé Webpack pour réduire les temps de chargement et offrir une expérience utilisateur plus réactive. En parallèle, j'ai adapté les choix de couleurs pour être conformes aux normes WCAG, renforçant ainsi l'accessibilité du site."
      },
      "toolsAndTech": [
        {
          "tool": "CSS",
          "description": "Mise en page et stylisation de l'interface utilisateur."
        },
        {
          "tool": "Webpack",
          "description": "Optimisation des performances et réduction des temps de chargement."
        },
        {
          "tool": "ESLint",
          "description": "Assurance de la qualité du code JavaScript grâce à l'analyse statique."
        },
        {
          "tool": "JavaScript",
          "description": "Langage de programmation utilisé pour créer des interactions dynamiques côté client."
        },
        {
          "tool": "WCAG",
          "description": "Conformité aux directives d'accessibilité pour rendre le site utilisable par le plus grand nombre."
        },
        {
          "tool": "Wave",
          "description": "Outil d'évaluation de l'accessibilité basé sur les normes WCAG."
        },
        {
          "tool": "Figma",
          "description": "Conception et prototypage de l'UI/UX."
        },
        {
          "tool": "GitHub Pages",
          "description": "Déploiement et hébergement de l'application."
        }
      ]
    },

    "kasa": {
      "id": "kasa",
      "title": "Location d'appartements entre particuliers",

      "description": {
        "intro": "Projet visant à reconstruire la plateforme de location d'appartements de Kasa avec React et React Router.",
        "objective": "L'objectif principal était de moderniser une application existante avec une pile technologique plus récente tout en respectant les contraintes de performances et d'accessibilité.",
        "challenge": "Le principal défi de ce projet a été de migrer d'une base de code ASP.NET vieillissante vers React, tout en garantissant la compatibilité et l'accessibilité. J'ai suivi les directives de codage de Kasa pour assurer la qualité du code.",
        "responsive": "Le site est conçu pour être pleinement réactif, assurant une expérience utilisateur fluide sur tous les appareils.",
        "collaboration": [
          "En travaillant en équipe, et notamment en adoptant des méthodologies comme Agile et Scrum, plusieurs améliorations auraient été possibles pour ce projet.",
          "1. Des revues de code régulières auraient assuré une meilleure qualité grâce aux échanges et au partage de connaissances.",
          "2. La collaboration lors des phases de conception UI/UX aurait apporté différentes perspectives, contribuant à un design plus riche et abouti.",
          "3. En collaborant avec une équipe, nous aurions pu solliciter un éventail plus large d'utilisateurs pour tester le projet, offrant ainsi des retours plus variés.",
          "4. Le partage des tâches aurait accéléré le développement, chaque membre apportant ses compétences spécifiques."
        ],
        "optimizationAndAccessibility": "Ce projet étant un exercice académique, il m'a été impossible de modifier les images sources pour des raisons pédagogiques. Cela a eu un impact sur le score de performance du site, spécifiquement dans le rapport Lighthouse où il atteint 92%. Dans un projet réel, j'aurais utilisé des outils de compression d'images en réduisant la taille des fichiers, ce qui aurait eu pour effet d'accélérer le temps de chargement. Concernant le score d'accessibilité, les limitations de couleur dans la maquette académique m'ont empêchée d'atteindre un score plus élevé. Dans un contexte professionnel, j'aurais ajusté les couleurs pour respecter les normes WCAG et améliorer l'accessibilité."
      },

      "toolsAndTech": [
        {
          "tool": "Outil Creat React app",
          "description": "Création d'interfaces utilisateur dynamiques."
        },
        {
          "tool": "React Router",
          "description": "Gestion du routage dans l'application."
        },
        {
          "tool": "Sass",
          "description": "Mise en page et stylisation."
        },
        {
          "tool": "ESLint",
          "description": "Employé pour garantir la robustesse du code."
        },
        {
          "tool": "Lighthouse",
          "description": "Mesure des performances et de l'accessibilité."
        },
        {
          "tool": "GitHub",
          "description": "Gestion du code source et collaboration."
        }
      ]
    },
    "argentBank": {
      "id": "argentBank",
      "title": "Plateforme de gestion bancaire",

      "description": {
        "intro": "Projet visant à développer une application web pour Argent Bank. La plateforme offre des fonctionnalités d'authentification, de gestion de comptes et de profil, et une éventuelle extension pour la gestion des transactions. Pour des fins de démonstration, utilisez les identifiants suivants : \n\nTony Stark: \nEmail: tony@stark.com\nPassword: password123\n\n ou Steve Rogers: \nEmail: steve@rogers.com\nPassword: password456",
        "objective": "L'objectif principal est de fournir à Argent Bank une solution robuste pour percer dans le secteur bancaire en ligne. Le projet est divisé en deux phases, commençant par l'authentification des utilisateurs et se terminant par la gestion des transactions.",
        "challenge": "Les défis de ce projet incluent l'intégration d'authentification JWT, la gestion d'états avec Redux, la création d'une interface réactive avec React, et le stockage sécurisé des données dans MongoDB.",
        "responsive": "Le site est conçu pour être pleinement réactif, assurant une expérience utilisateur fluide sur tous les appareils.",
        "collaboration": [
          "En travaillant en équipe, et notamment en adoptant des méthodologies comme Agile et Scrum, plusieurs améliorations auraient été possibles pour ce projet.",
          "1. Des revues de code régulières auraient assuré une meilleure qualité grâce aux échanges et au partage de connaissances.",
          "2. La collaboration lors des phases de conception UI/UX aurait apporté différentes perspectives, contribuant à un design plus riche et abouti.",
          "3. En collaborant avec une équipe, nous aurions pu solliciter un éventail plus large d'utilisateurs pour tester le projet, offrant ainsi des retours plus variés.",
          "4. Le partage des tâches aurait accéléré le développement, chaque membre apportant ses compétences spécifiques."
        ],
        "optimizationAndAccessibility": "L'application a été optimisée pour des performances rapides et une grande accessibilité. Des outils tels que Lighthouse seront utilisés pour mesurer et améliorer ces aspects."
      },

      "toolsAndTech": [
        {
          "tool": "Outil Creat React app",
          "description": "Création d'interfaces utilisateur dynamiques."
        },
        {
          "tool": "React Router",
          "description": "Gestion du routage dans l'application."
        },
        {
          "tool": "Redux",
          "description": "Gère l'état global de l'application."
        },
        {
          "tool": "Styled components",
          "description": "Bibliothèque javascript pour la gestion du CSS."
        },
        {
          "tool": "ESLint",
          "description": "Employé pour garantir la robustesse du code."
        },
        {
          "tool": "Lighthouse",
          "description": "Mesure des performances et de l'accessibilité."
        },
        {
          "tool": "MongoDB",
          "description": "Base de données utilisée pour stocker les informations des utilisateurs."
        },
        {
          "tool": "GitHub",
          "description": "Gestion du code source et collaboration."
        }
      ]
    },
    "wealthHealth": {
      "id": "wealthHealth",
      "title": "Gestion des dossiers des employés de Wealth-Health",

      "description": {
        "intro": "Wealth-Health est une grande société financière qui utilise une application web interne pour gérer les dossiers des employés. L'application est ancienne et utilise jQuery côté front-end, entraînant des bugs considérables",
        "objective": "Moderniser l'application en la basculant sur une architecture React et remplacer les plugins jQuery par des composants React. Le but est d'améliorer les performances et de réduire les plaintes des utilisateurs.",
        "challenge": "Durant la Phase 1, migrer vers React a été un défi à cause des différences d'architecture. J'ai utilisé l'outil Vite pour faciliter cette transition et j'ai testé chaque composant après sa réécriture. Pour la Phase 2, remplacer les plugins jQuery par des composants React a présenté des défis de compatibilité. Cependant, une analyse minutieuse des plugins et une réécriture ciblée ont permis une transition en douceur.",
        "responsive": "Le site est conçu pour être pleinement réactif, assurant une expérience utilisateur fluide sur tous les appareils.",
        "collaboration": [
          "En travaillant en équipe, et notamment en adoptant des méthodologies comme Agile et Scrum, plusieurs améliorations auraient été possibles pour ce projet.",
          "1. Des revues de code régulières auraient assuré une meilleure qualité grâce aux échanges et au partage de connaissances.",
          "2. La collaboration lors des phases de conception UI/UX aurait apporté différentes perspectives, contribuant à un design plus riche et abouti.",
          "3. En collaborant avec une équipe, nous aurions pu solliciter un éventail plus large d'utilisateurs pour tester le projet, offrant ainsi des retours plus variés.",
          "4. Le partage des tâches aurait accéléré le développement, chaque membre apportant ses compétences spécifiques."
        ],
        "optimizationAndAccessibility": "Effectuer des tests de performance Lighthouse en comparant l'ancienne et la nouvelle application."
      },

      "toolsAndTech": [
        {
          "tool": "Outil Vite",
          "description": "Création d'interfaces utilisateur dynamiques."
        },
        {
          "tool": "React Router",
          "description": "Gestion du routage dans l'application."
        },
        {
          "tool": "React Context",
          "description": "Gère l'état global de l'application."
        },
        {
          "tool": "Styled components",
          "description": "Bibliothèque javascript pour la gestion du CSS."
        },
        {
          "tool": "ESLint",
          "description": "Employé pour garantir la robustesse du code."
        },
        {
          "tool": "Lighthouse",
          "description": "Mesure des performances et de l'accessibilité."
        },
        {
          "tool": "GitHub",
          "description": "Gestion du code source et collaboration."
        },
        {
          "tool": "Vercel",
          "description": "Plateforme de déploiement."
        },
        {
          "tool": "NPM",
          "description": "Pour publier la librairie."
        }
      ]
    }
  },
  "skillsData": {
    "empathy": {
      "skill": "Empathie",
      "description": "L'utilisateur est au cœur de ma démarche, créant des interfaces intuitives et pertinentes."
    },
    "organization": {
      "skill": "Sens de l’organisation",
      "description": "De l'hôpital au codage, j'ai appris à prioriser mes actions et à être efficace."
    },
    "adaptability": {
      "skill": "Capacité d’adaptation",
      "description": "J'adore rejoindre de nouvelles équipes, rapidement m'adapter et collaborer efficacement."
    },
    "listening": {
      "skill": "Écoute",
      "description": "Je prends le temps d'écouter attentivement et de valoriser chaque feedback."
    },
    "curiosity": {
      "skill": "Curiosité",
      "description": "Chaque jour est une chance d'apprendre et de perfectionner mes compétences en développement."
    },
    "autonomy": {
      "skill": "Autonomie",
      "description": "J'aime prendre des initiatives pour avancer efficacement sur mes projets."
    },
    "tenacity": {
      "skill": "Ténacité",
      "description": "Je reste engagée face à chaque défi, cherchant toujours la solution optimale."
    },
    "relationship": {
      "skill": "Aisance relationnelle",
      "description": "La collaboration est ma force. Ensemble, nous obtenons les meilleurs résultats."
    }
  },

  "hardSkillsData": {
    "programmingLanguages": {
      "category": "Langages de Programmation",
      "skills": [
        {
          "name": "JavaScript",
          "url": "https://developer.mozilla.org/fr/docs/Web/JavaScript"
        },
        {
          "name": "HTML",
          "url": "https://developer.mozilla.org/fr/docs/Web/HTML"
        },
        {
          "name": "CSS",
          "url": "https://developer.mozilla.org/fr/docs/Web/CSS"
        }
      ]
    },
    "librariesFrameworks": {
      "category": "Bibliothèques / Frameworks",
      "skills": [
        {
          "name": "React.js",
          "url": "https://reactjs.org/"
        },
        {
          "name": "Redux",
          "url": "https://redux.js.org/"
        },
        {
          "name": "Context API",
          "url": "https://react.dev/"
        }
      ]
    },

    "preprocessors": {
      "category": "Préprocesseurs & CSS-in-JS",
      "skills": [
        {
          "name": "Styled Components",
          "url": "https://styled-components.com/"
        },
        {
          "name": "Sass",
          "url": "https://sass-lang.com/"
        }
      ]
    },
    "toolsEnvironments": {
      "category": "Outils et Environnements",
      "skills": [
        {
          "name": "Git & GitHub",
          "url": "https://github.com/"
        },
        {
          "name": "Webpack",
          "url": "https://webpack.js.org/"
        },
        {
          "name": "Babel",
          "url": "https://babeljs.io/"
        },
        {
          "name": "npm",
          "url": "https://www.npmjs.com/"
        },
        {
          "name": "Visual Studio Code",
          "url": "https://code.visualstudio.com/"
        }
      ]
    },

    "testingTools": {
      "category": "Outils de test",
      "skills": [
        {
          "name": "Jest",
          "url": "https://jestjs.io/"
        },
        {
          "name": "Vitest",
          "url": "https://vitest.dev/guide/"
        }
      ]
    },

    "otherTechnicalSkills": {
      "category": "Autres Compétences Techniques",
      "skills": [
        {
          "name": "Responsive Web Design",
          "url": "https://developer.mozilla.org/fr/docs/Apprendre/CSS/CSS_layout/Responsive_Design"
        },
        {
          "name": "Web Accessibility",
          "url": "https://www.w3.org/WAI/fundamentals/accessibility-intro/"
        }
      ]
    },
    "methodologies": {
      "category": "Méthodologies",
      "skills": [
        {
          "name": "Agile & Scrum",
          "url": "https://www.scrumguides.org/scrum-guide.html"
        },
        {
          "name": "Kanban",
          "url": "https://kanbanguides.org/francais/"
        }
      ]
    }
  },
  "professionalExperienceData": [
    {
      "position": "Missions d'intérim",
      "institution": "Laboratoire Biolab, Clinique Pasteur",
      "duration": "2015 – 2022",
      "location": "Localisation : Toulouse"
    },
    {
      "position": "Missions en intérim au CHU",
      "duration": "2010 – 2015",
      "location": "Localisation : Toulouse"
    },
    {
      "position": "Chirurgie générale",
      "institution": "Hôpital Saint Louis",
      "duration": "2004 – 2010",
      "location": "Localisation : Paris"
    }
  ],

  "educationSection": {
    "card1": {
      "dateRange": "2022 - 2023",
      "title": "Formation développeur d’application javascript-react"
    },
    "card2": {
      "dateRange": "2004",
      "title": "Diplôme d’Etat Infirmier"
    },
    "card3": {
      "dateRange": "1999",
      "title": "Baccalauréat SMS (Sciences Médico-Sociales)"
    }
  },

  "hobbies": {
    "item1": {
      "text": "Cuisine",
      "alt": "Cooking logo"
    },
    "item2": {
      "text": "Lecture",
      "alt": "Reading logo"
    },
    "item3": {
      "text": "Randonnée",
      "alt": "Hiking logo"
    }
  },

  "bioPage": {
    "header": {
      "h1": "Développeuse d'application Javascript React",
      "bioDescription": "Après une carrière enrichissante en tant qu'infirmière, je me suis reconvertie dans le développement web avec une spécialisation dans le front-end. Ultra motivée, je suis prête à relever de nouveaux défis dans ce domaine passionnant."
    },
    "sectionTitles": {
      "softSkills": "Mes compétences transverses",
      "hardSkills": "Mes compétences techniques",
      "professionalExperience": "Mon parcours professionnel",
      "education": "Formations et qualifications",
      "hobbies": "Centres d'intérêts"
    }
  },
  "footer": {
    "paragraphs": {
      "designedBy": "Conçu et développé avec passion par",
      "copyright": "© 2023 - Angélique Rosin",
      "findMe": "Retrouvez-moi sur :"
    }
  }
}
